DKrepsky/CC3200-Linux-SDK/examples/Websock Camera/camera_app.c
#ifdef ENABLE_JPEG
static int CreateJpegHeader(char *header, int width, int height,
                            int format, int restart_int, int qscale);
static int DefineRestartIntervalMarker(char *pbuf, int ri);
static int DefineHuffmanTableMarkerAC(char *pbuf, unsigned int *htable, int class_id);
static int DefineHuffmanTableMarkerDC(char *pbuf, unsigned int *htable, int class_id);
static int DefineQuantizationTableMarker (unsigned char *pbuf, int qscale, int format);
static int ScanHeaderMarker(char *pbuf, int format);
static int FrameHeaderMarker(char *pbuf, int width, int height, int format);
static int JfifApp0Marker(char *pbuf);
#endif 

//*****************************************************************************
//
//!     Start Camera 
//!     1. Establishes connection w/ AP//
//!     2. Initializes the camera sub-components//! GPIO Enable & Configuration
//!     3. Listens and processes the image capture requests from user-applications
//!    
//!	\param[out]                      WriteBuffer - Pointer to the Frame Buffer  
//!     \return                     None                         
//
//*****************************************************************************

unsigned short StartCamera(char **WriteBuffer)
{
	unsigned short Writelength;
    //
    // Waits in the below loop till Capture button is pressed
    //
    Writelength = CaptureImage(WriteBuffer);

    return(Writelength);

}
//*****************************************************************************
//
//!     InitCameraComponents 
//!     PinMux, Camera Initialization and Configuration   
//!
//!	\param                      None  
//!     \return                     None           
//
//*****************************************************************************

void InitCameraComponents()
{
    //
    // Configure device pins
    //
    PinMuxConfig();
    //
    // Initialize I2C Interface
    //   
    I2CInit();
    //
    // Initialize camera controller
    //
    CamControllerInit();
    //
    // Initialize camera sensor
    //
    CameraSensorInit();

#ifdef ENABLE_JPEG
    //
    // Configure Sensor in Capture Mode
    //

    StartSensorInJpegMode();

#endif
}

//*****************************************************************************
//
//!     CaptureImage 
//!     Configures DMA and starts the Capture. Post Capture writes to SFLASH 
//!    
//!	\param                      None  
//!     \return                     None
//!                               
//
//*****************************************************************************

static unsigned short CaptureImage(char** WriteBuffer)
{
    //
    // Configure DMA in ping-pong mode
    //

    DMAConfig();
    
    //
    // Perform Image Capture 
    //
    MAP_CameraCaptureStart(CAMERA_BASE);
    while(g_frame_end == 0)
        ;
    MAP_CameraCaptureStop(CAMERA_BASE, true);

    //
    // Create JPEG Header
    //
#ifdef ENABLE_JPEG
    memset(g_image.g_header, '\0', sizeof(g_image.g_header));
    g_header_length = CreateJpegHeader((char *)&(g_image.g_header[0]), PIXELS_IN_X_AXIS,
                                       PIXELS_IN_Y_AXIS, 0, 0x0020, 9);

    // This loop pushes the header to the end of the array so that the entire picture can be contiguous in memory
    unsigned short shift;

    for(shift=1; shift <= g_header_length; shift++)
    {
    	g_image.g_header[SMTP_BUF_LEN - shift] = g_image.g_header[g_header_length - shift];

    }
#endif
    *WriteBuffer = &(g_image.g_header[SMTP_BUF_LEN - g_header_length]);

	return(g_header_length + g_frame_size_in_bytes);
}
//*****************************************************************************
//
//!     DMA Config
//!     Initialize the DMA and Setup the DMA transfer
//!    
//!	\param                      None  
//!     \return                     None                  
//
//*****************************************************************************
static void DMAConfig()
{
    memset(g_image.g_image_buffer,0xF80F,sizeof(g_image.g_image_buffer));
    p_buffer = &(g_image.g_image_buffer[0]);
    //
    // Initilalize DMA 
    //
    UDMAInit();
    //
    // Setup ping-pong transfer
    //
    DMASetupTransfer(UDMA_CH22_CAMERA,UDMA_MODE_PINGPONG,TOTAL_DMA_ELEMENTS,UDMA_SIZE_32,
                     UDMA_ARB_8,(void *)CAM_BUFFER_ADDR, UDMA_SRC_INC_32,
                     (void *)p_buffer, UDMA_DST_INC_32);
    //
    //  Pong Buffer
    // 
    p_buffer += TOTAL_DMA_ELEMENTS; 
    DMASetupTransfer(UDMA_CH22_CAMERA|UDMA_ALT_SELECT,UDMA_MODE_PINGPONG,TOTAL_DMA_ELEMENTS,
                     UDMA_SIZE_32, UDMA_ARB_8,(void *)CAM_BUFFER_ADDR,
                     UDMA_SRC_INC_32, (void *)p_buffer, UDMA_DST_INC_32);
    //
    //  Ping Buffer
    // 
    p_buffer += TOTAL_DMA_ELEMENTS; 

    g_dma_txn_done = 0;
    g_frame_size_in_bytes = 0;
    g_frame_end = 0;
    g_total_dma_intrpts = 0;

    //
    // Clear any pending interrupt
    //
    HWREG(0x4402609C) |= 1 << 8;

    //
    // DMA Interrupt unmask from apps config
    //
    HWREG(0x44026094) |= 1 << 8;
}

//*****************************************************************************
//
//!     Camera Controller Initialisation 
//!    
//!	\param                      None  
//!     \return                     None
//!                               
//
//*****************************************************************************

static void CamControllerInit()
{
    MAP_PRCMPeripheralClkEnable(PRCM_CAMERA, PRCM_RUN_MODE_CLK);
    MAP_PRCMPeripheralReset(PRCM_CAMERA);

#ifndef ENABLE_JPEG
    // Configure Camera clock from ARCM
    // CamClkIn = ((240)/((1+1)+(1+1))) = 60 MHz
    HWREG(0x44025000) = 0x0101;
#else
    HWREG(0x44025000) = 0x0000;
#endif 

    MAP_CameraReset(CAMERA_BASE);

#ifndef ENABLE_JPEG
    MAP_CameraParamsConfig(CAMERA_BASE, CAM_HS_POL_HI, CAM_VS_POL_HI,
                       CAM_ORDERCAM_SWAP|CAM_NOBT_SYNCHRO);
#else
    MAP_CameraParamsConfig(CAMERA_BASE, CAM_HS_POL_HI,CAM_VS_POL_HI,
                       CAM_NOBT_SYNCHRO|CAM_IF_SYNCHRO|CAM_BT_CORRECT_EN);
#endif 

    MAP_CameraIntRegister(CAMERA_BASE, CameraIntHandler);

#ifndef ENABLE_JPEG
    MAP_CameraXClkConfig(CAMERA_BASE, 60000000,3750000);
#else
    MAP_CameraXClkConfig(CAMERA_BASE, 120000000,24000000);
#endif 

    MAP_CameraThresholdSet(CAMERA_BASE, 8);
    MAP_CameraIntEnable(CAMERA_BASE, CAM_INT_FE);
    MAP_CameraDMAEnable(CAMERA_BASE);
}


//*****************************************************************************
//
//!     Camera Interrupt Handler
//!    
//!	\param                      None  
//!     \return                     None                              
//
//*****************************************************************************
static void CameraIntHandler()
{
	//MAP_CameraIntClear(CAMERA_BASE, CAM_INT_FE);
    if(g_total_dma_intrpts > 1 && MAP_CameraIntStatus(CAMERA_BASE) & CAM_INT_FE)
    {
        MAP_CameraIntClear(CAMERA_BASE, CAM_INT_FE);
        g_frame_end = 1;
        MAP_CameraCaptureStop(CAMERA_BASE, true);
    }

    if(HWREG(0x440260A4) & (1<<8))
    {
        // Camera DMA Done clear
        HWREG(0x4402609C) |= 1 << 8;

